Show / Hide Table of Contents
Class SectionResultMesh
Section result mesh
Inheritance
System.Object
SectionResultBase
SectionResultMesh
Inherited Members
 SectionResultBase.Loading
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class SectionResultMesh : SectionResultBase
Constructors
Improve this Doc   View Source
SectionResultMesh()
Constructor
Declaration
public SectionResultMesh()
Properties
Improve this Doc   View Source
Elements
Elements
Declaration
public List<MeshElement2D> Elements { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<MeshElement2D>
Improve this Doc   View Source
Points
Section points
Declaration
public List<Point2D> Points { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Point2D>
 Improve this Doc
 View Source